In [451]:
import pandas as pd
import numpy as np

In [452]:
# Load csv data file
data = pd.read_csv('data/i4talent.csv')
data

,WerknemerID,datum,geboortedatum,indiensttreding_datum,uitdiensttreding_datum,leeftijd,lengte_dienst,stad,afdeling,klant_id,geslacht_id,geslacht,uitdiensttreding_reden,uitdiensttreding_type,STATUS_JAAR,STATUS,BUSINESS_UNIT
0,6962,2018-12-31 05:06:00,1989-06-26 05:06:00,2013-05-23 05:06:00,1905-01-01 05:06:00,29.0,5.0,Amstelveen,BI,30,V,Vrouw,Niet van toepassing,Niet van toepassing,2018,Actief,Detachering
1,6212,2016-12-30 05:06:00,1983-08-25 05:06:00,2010-04-24 05:06:00,1905-01-01 05:06:00,33.0,6.0,Utrecht,Accountant,21,M,Man,Niet van toepassing,Niet van toepassing,2016,Actief,Detachering
2,5325,2018-12-31 05:06:00,1976-04-24 05:06:00,2006-06-09 05:06:00,1905-01-01 05:06:00,42.0,12.0,Amsterdam,BI,42,V,Vrouw,Niet van toepassing,Niet van toepassing,2018,Actief,Detachering
3,8193,2018-12-31 05:06:00,1998-10-26 05:06:00,2018-04-28 05:06:00,1905-01-01 05:06:00,20.0,NaN,Utrecht,BI,21,V,Vrouw,Niet van toepassing,Niet van toepassing,2018,Actief,Detachering
4,5926,2013-12-31 05:06:00,1981-03-19 05:06:00,2009-01-09 05:06:00,1905-01-01 05:06:00,32.0,4.0,Den Haag,Accountant,18,M,Man,Niet van toepassing,Niet van toepassing,2013,Actief,Detachering
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49748,6305,2018-12-31 05:06:00,1984-04-20 05:06:00,2010-08-28 05:06:00,1905-01-01 05:06:00,34.0,NaN,Rotterdam,Business analist,46,V,Vrouw,Niet van toepassing,Niet van toepassing,2018,Actief,Detachering
49749,8025,2017-12-31 05:06:00,1997-06-25 05:06:00,2017-08-12 05:06:00,2019-02-12 05:06:00,20.0,0.0,Amsterdam,NaN,44,M,Man,Niet van toepassing,Niet van toepassing,2017,Actief,Detachering
49750,2632,2014-12-31 05:06:00,1961-04-27 05:06:00,1998-07-09 05:06:00,1905-01-01 05:06:00,53.0,16.0,Haarlem,Business analist,5,V,Vrouw,Niet van toepassing,Niet van toepassing,2014,Actief,Detachering
49751,7122,2014-12-31 05:06:00,1990-09-08 05:06:00,2014-01-10 05:06:00,2019-12-30 05:06:00,24.0,0.0,Barendrecht,Credit controller,13,M,Man,Niet van toepassing,Niet van toepassing,2014,Actief,Detachering
49752,7353,2018-12-31 05:06:00,1992-05-28 05:06:00,2014-12-08 05:06:00,1905-01-01 05:06:00,26.0,4.0,NaN,Credit controller,12,M,Man,Niet van toepassing,Niet van toepassing,2018,Actief,Detachering

# Examine data

In [453]:
# data.dtypes
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49753 entries, 0 to 49752
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   WerknemerID             49753 non-null  int64
 1   datum                   49753 non-null  object
 2   geboortedatum           49753 non-null  object
 3   indiensttreding_datum   49753 non-null  object
 4   uitdiensttreding_datum  49753 non-null  object
 5   leeftijd                44653 non-null  float64
 6   lengte_dienst           44802 non-null  float64
 7   stad                    44210 non-null  object
 8   afdeling                44688 non-null  object
 9   klant_id                49753 non-null  int64
 10  geslacht_id             49753 non-null  object
 11  geslacht                49753 non-null  object
 12  uitdiensttreding_reden  49753 non-null  object
 13  uitdiensttreding_type   49753 non-null  object
 14  STATUS_JAAR             49753 non-null  int64
 15  STATUS                  49753 non-null  object
 16  BUSINESS_UNIT           49753 non-null  object
dtypes: float64(2), int64(3), object(12)
memory usage: 6.5+ MB

In [454]:
data['stad'].value_counts(dropna = False)

Amsterdam              10217
NaN                     5543
Rotterdam               4661
Den Haag                3646
Utrecht                 2878
Rijswijk                2270
Haarlem                 1857
Zoetermeer              1851
Dordrecht               1823
Zaandam                 1638
Eindhoven               1400
Tilburg                 1278
Almere                  1117
Breda                   1060
Leiden                   840
Alphen aan den Rijn      826
Delft                    805
Amstelveen               733
Lelystad                 631
Schiedam                 628
Gouda                    580
Capelle                  563
Zeist                    554
Hoogeveen                497
Roermond                 467
Pijnacker                290
Woerden                  287
Middelburg               224
Barendrecht              216
Alblasserdam             213
Veenendaal               160
Name: stad, dtype: int64

In [455]:
data['afdeling'].value_counts(dropna = False)

Financial controller         9300
Accountant                   7779
Boekhouder                   7707
Business analist             7556
BI                           6435
Credit controller            5340
NaN                          5065
Project controller            243
Business controller            88
Administratief medewerker      60
HR                             51
Marketing                      41
Business development           35
Office manager                 20
IT                             18
Legal                          15
Name: afdeling, dtype: int64

In [456]:
data['geslacht_id'].value_counts(dropna = False)

V    25953
M    23800
Name: geslacht_id, dtype: int64

In [457]:
data['geslacht'].value_counts(dropna = False)

Vrouw    25953
Man      23800
Name: geslacht, dtype: int64

In [458]:
data['uitdiensttreding_reden'].value_counts(dropna = False)

Niet van toepassing    48266
Pensioen                 886
Vertrek                  385
Ontslag                  216
Name: uitdiensttreding_reden, dtype: int64

In [459]:
data['uitdiensttreding_type'].value_counts(dropna = False)

Niet van toepassing    48266
Vrijwillig              1271
Niet vrijwillig          216
Name: uitdiensttreding_type, dtype: int64

In [460]:
data['STATUS'].value_counts(dropna = False)

Actief       48266
BeÃ«indigd     1487
Name: STATUS, dtype: int64

In [461]:
data['BUSINESS_UNIT'].value_counts(dropna = False)

Detachering    49166
Intern           587
Name: BUSINESS_UNIT, dtype: int64

In [462]:
# Find number of NaN values for each column
data.isnull().sum()

WerknemerID                  0
datum                        0
geboortedatum                0
indiensttreding_datum        0
uitdiensttreding_datum       0
leeftijd                  5100
lengte_dienst             4951
stad                      5543
afdeling                  5065
klant_id                     0
geslacht_id                  0
geslacht                     0
uitdiensttreding_reden       0
uitdiensttreding_type        0
STATUS_JAAR                  0
STATUS                       0
BUSINESS_UNIT                0
dtype: int64

In [463]:
# Find number of rows with at least one NaN value
data.isnull().any(axis=1).sum()

17671

# Filling in missing data

In [464]:
# Change date strings to type Timestamp
cols = ['datum', 'geboortedatum', 'indiensttreding_datum', 'uitdiensttreding_datum']
data[cols] = data[cols].apply(pd.to_datetime, errors='raise')
# data.dtypes

In [465]:
# Calculate leeftijd by subtracting geboortedatum from datum
new_cols = ['leeftijd_v2', 'lengte_dienst_v2']
data[new_cols[0]] = (data['datum'] - data['geboortedatum']) / pd.Timedelta(365, 'days') # assuming one year consists of 365 days

# Create empty column lengte_dienst_v2
data[new_cols[1]] = np.nan

# If STATUS is Actief -> lengte_dienst_v2 = indiensttreding_datum - datum
# (uitdiensttreding_datum is ignored here)
data.loc[data['STATUS'] == 'Actief', new_cols[1]] = (data['datum'] - data['indiensttreding_datum']) / pd.Timedelta(365, 'days')

# If STATUS is BeÃ«indigd -> lengte_dienst_v2 = indiensttreding_datum - uitdiensttreding_datum
data.loc[data['STATUS'] == 'BeÃ«indigd', new_cols[1]] = (data['uitdiensttreding_datum'] - data['indiensttreding_datum']) / pd.Timedelta(365, 'days')

data[new_cols] = data[new_cols].round(0)

In [466]:
# Check if everything went OK
data['leeftijd_v2'].value_counts().sort_index()

19.0      63
20.0     268
21.0     540
22.0     757
23.0     910
24.0    1049
25.0    1137
26.0    1229
27.0    1214
28.0    1222
29.0    1238
30.0    1259
31.0    1154
32.0    1150
33.0    1152
34.0    1181
35.0    1191
36.0    1165
37.0    1179
38.0    1161
39.0    1151
40.0    1136
41.0    1139
42.0    1155
43.0    1149
44.0    1147
45.0    1157
46.0    1168
47.0    1155
48.0    1172
49.0    1172
50.0    1207
51.0    1200
52.0    1210
53.0    1188
54.0    1172
55.0    1166
56.0    1148
57.0    1148
58.0    1131
59.0    1143
60.0    1290
61.0     793
62.0     735
63.0     692
64.0     672
65.0     936
66.0       2
Name: leeftijd_v2, dtype: int64

In [467]:
# Check if everything went OK
data['lengte_dienst_v2'].value_counts().sort_index()

0.0      985
1.0     2098
2.0     2253
3.0     2238
4.0     2283
5.0     2297
6.0     2239
7.0     2316
8.0     2600
9.0     2340
10.0    2423
11.0    2442
12.0    2529
13.0    3108
14.0    2212
15.0    2188
16.0    2163
17.0    2155
18.0    1963
19.0    1735
20.0    1501
21.0    1183
22.0     937
23.0     714
24.0     514
25.0     321
26.0      16
Name: lengte_dienst_v2, dtype: int64

In [468]:
# Find new number of rows with at least one NaN value
data.drop(columns=['leeftijd', 'lengte_dienst']).isnull().any(axis=1).sum()

10043

In [469]:
data.shape

(49753, 19)

In [471]:
# Fill in rest of missing data (stad & afdeling) with 'Unknown'
# data = data.fillna('Unknown')

# OR

# Remove all rows with NaN values for stad or afdeling (to skip leeftijd & lengte_dienst)
data = data.dropna(subset = ['stad', 'afdeling'])
data.shape

(39710, 19)

# Modelling